tutorials/incompressible/wDissipationTempBlockageConcentrationResidenceSinkTauSimpleFoam/DoubleGermanCarreau/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;
//existing boundaries (ignore everything else and set defaultfaces to empty) ['', '    outlet\n', '    defaultName\n', '    inlet\n']
boundaryField
{
    outlet
    {
       type            fixedValue;
       value           uniform 1e-5;  
    }

    defaultName
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    centralInlet
    {
        type            zeroGradient;
    }
 
	leftInlet
    {
        type            zeroGradient;
    }
	
    rightInlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
